---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.FrictionFactor
source: html/b50a8aef-e217-e788-8d82-00251c30d4dd.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.FrictionFactor Property

The calculated friction factor of this segment, dimensionless.

## Syntax (C#)
```csharp
public double FrictionFactor { get; }
```